import requests

text = """Описание
Форма: обычная
Контуры: ровные, четкие
Структура:
-В переходных зонах и области периуретральных желез – диффузно неоднородная с участками краевого фиброза и микрокальцинатами, не увеличена, мелкая протоковая система не расширена;
-В центральных зонах – однородная;
-В периферических зонах – однородная;
Простатическая часть уретры – не деформирована;
Эхогенность предстательной железы: средняя
Размеры — 45х35х24 мм
Объем 19,8 см3 (норма до 25 см3)
При ЦДК – без локальных и диффузных изменений васкуляризации;

Уретральный канал и шейка мочевого пузыря не деформированы,
Семенные пузырьки: поперечник 10 мм, однородные, гипоэхогенные; стенки пузырьков не утолщены.
Перипростатические вены не расширены, умеренно извиты.

ЗАКЛЮЧЕНИЕ: Диффузные изменения паренхимы предстательной железы с локальным фиброзом и микрокальцинозом.
"""

print(requests.post("http://localhost:8000/extract", json={"text": text}).json())
